import { ref } from 'vue'
import { defineStore } from 'pinia'

// product otop ภาคเหนือ
export const Otop_northStore = defineStore('Otop_north', () => {
  const Otop_north_list = ref([
    {
      name: 'กล่องทิชชู่ผ้าปัก',
      from: 'เชียงใหม่',
      category: 'ของใช้และของประดิษฐ์',
      price: 180,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/1-1-14.jpg.webp',
      text: 'กล่องทิชชู่ผ้าปักจากจังหวัดเชียงใหม่ที่มีเอกลักษณ์และดีไซน์ที่โดดเด่นมากเลยค่ะ โดยดีไซน์ที่น่าสนใจคือการปักให้มีรูปทรงคล้ายๆกับเสื้อทรงโปโล สีสันสดใส ช่วยให้ทิชชู่ของเพื่อนๆไม่เลอะง่ายด้วยนะคะ รับรองคุณภาพโดยศูนย์โอท็อป เชียงใหม่'
    },
    {
      name: 'ผ้าทอขนแกะ',
      from: 'แม่ฮ่องสอน',
      category: 'ผ้าและเครื่องแต่งกาย',
      price: 1200,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/2-1-14.jpg.webp',
      text: ' สำหรับผ้าทอขนแกะนี้สามารถใช้ประโยชน์ได้หลากหลาย ไม่ว่าจะเป็นการนำมาพันคอเพื่อคลายความหนาวหรือจะนำมาห่มร่างกายก็ได้เช่นกัน แล้วแต่การใช้งานของเพื่อนๆได้เลยค่ะ ผ้าทอขนแกะถือเป็นผ้าทอที่มีการประยุกต์จากภูมิปัญญาดั้งเดิมของชาวปกากะญอ '
    },
    {
      name: 'เสื้อผ้าฝ้ายถักทอมือ',
      from: 'เชียงใหม่',
      category: 'ผ้าและเครื่องแต่งกาย',
      price: 299,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/4-1-16.jpg.webp',
      text: 'สินค้าโอท็อปอีกหนึ่งอย่างที่อยากนำมาแนะนำให้ซื้อไปเป็นของฝากหรือจะซื้อไว้ใช้งานเองก็ดี เพราะเป็นของใช้ที่หลายบ้านต้องมีเพื่อใช้งานเวลาเข้าครัวแน่นอนนั้นก็คือครก ซึ่งครกชนิดนี้สามารถพกพาสะดวกเพราะมีการร้อยสายผ้าเพื่อไว้ถือเป็นหูหิ้วได้และสามารถถอดสายออกไปซักได้ '
    },
    {
      name: 'ครกหูหิ้ว',
      from: 'ตาก',
      category: 'ของใช้และของประดิษฐ์',
      price: 1200,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/5-1-16.jpg.webp',
      text: 'เดรสกะเหรี่ยงตัวนี้มีดีไซน์และสีที่สวยงาม สามารถใส่ไปเที่ยวหรืออยู่้านก็สามารถใส่ได้เพราะตัวผ้าทำออกมาไม่ร้อนและสีของเดรสก็ใช้การย้อมสีธรรมชาติ อีกทั้งตัวผ้าทำด้วยการทอมือ ทำให้เป็นงานที่ประณีตและมีดีไซน์ที่สวยงาม'
    },
    {
      name: 'เดรสกะเหรี่ยงย้อมสีธรรมชาติ',
      from: 'แม่ฮ่องสอน',
      category: 'เสื้อผ้าและเครื่องแต่งกาย',
      price: 550,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/3-1-15.jpg.webp',
      text: 'เดรสกะเหรี่ยงตัวนี้มีดีไซน์และสีที่สวยงาม สามารถใส่ไปเที่ยวหรืออยู่้านก็สามารถใส่ได้เพราะตัวผ้าทำออกมาไม่ร้อนและสีของเดรสก็ใช้การย้อมสีธรรมชาติ อีกทั้งตัวผ้าทำด้วยการทอมือ ทำให้เป็นงานที่ประณีตและมีดีไซน์ที่สวยงาม'
    },
    {
      name: 'ลำไยอบแห้ง เกรด1A ตราถุงทอง',
      from: 'แม่ฮ่องสอน',
      category: 'ของขบเคี้ยว',
      price: 70,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/6-1-16.jpg.webp',
      text: 'ลำไยอบแห้งจากจังหวัดลำพูนเป็นอีกหนึ่งในของotopที่ควรซื้อเลยค่ะ เพราะมีเนื้อที่หวานธรรมชาติ ไม่จำเป็นต้องใส่น้ำตาล ซึ่งทางยี่ห้อนี้ใช้ลำไยพันธุ์ อีดอ ที่ทำให้ลำไยมีสีทองน่ารับประทาน สามารถนำมาทานเล่นหรือจะนำมาประกอบอาหารชนิดอื่นๆได้'
    },
    {
      name: 'กล้วยหอมทองทอดกรอบ',
      from: 'พะเยา',
      category: 'ของขบเคี้ยว',
      price: 55,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/7-1-15.jpg.webp',
      text: 'กล้วยหอมทอดกรอบของจังหวัดพะเยา เป็นอีกหนึ่งสินค้าotopที่อร่อยที่สุดของจังหวัดพะเยา เพราะผลิตจากกล้วยไข่พระตะบอง ซึ่งเป็นกล้วยพันธ์พื้นเมืองของทางภาคเหนือ พอนำมาทอดกรอบแล้วจะมีสีที่น่ารับประทานและมีความหอมหวานธรรมชาติ '
    },
    {
      name: 'มะขามหวานเพชรบูรณ์',
      from: 'เพชรบูรณ์',
      category: 'ของขบเคี้ยว',
      price: 120,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/8-1-16.jpg.webp',
      text: 'ถ้าพูดถึงจังหวัดเพชรูรณ์หลายๆคนต้องนึกถึงมะขาม เพราะจังหวัดเพชรบูรณ์ได้ชื่อว่าเป็นเมืองมะขามหวานเพราะมีมะขามปลูกกันแทบทุกอำเภอ โดยเฉพาะอำเภอชนแดน ซึ่งเป็นอำเภอที่ผลิตมะขามได้คุณภาพดี มีหลากหลายพันธุ์ มะขามยี่ห้อนี้ก็เป็นหนึ่งในของดีของอำเภอชนแดนเลย'
    },
    {
      name: 'น้ำพริกตาแดงแม่เล็บทอง(สูตรโบราณ)',
      from: 'ลำพูน',
      category: 'อาหาร',
      price: 20,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/9-1-12.jpg.webp',
      text: 'เมื่อนึกถึงภาคเหนือเราก็จะนึกถึงน้ำพริกตาแดงกันใช่มั้ยคะ วันนี้เราเลยนำน้ำพริกตาแดงสินค้าotopจากจังหวัดลำพูนมาให้เพื่อนๆเลือกชมกันค่ะ โดยน้ำพริกยี่ห้อนี้มีมานาน ทำให้การันตีเรื่องรสชาติและคุณภาพของน้ำพริกได้เลย อีกทั้งยังมีราคาถูกมาก กระปุกนึงไม่ถึงยี่สิบบาท สามารถพกพาได้ง่ายอีกด้วย'
    },
    {
      name: 'ถั่วเน่าป่น ตราแม่อำพร',
      from: 'เชียงใหม่',
      category: 'อาหาร',
      price: 40,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/11/10-1-8.jpg.webp',
      text: 'ถั่วเน่าเป็นอีกหนึ่งสิ่งที่สำคัญต่อการทำอาหารทางภาคเหนือ ไม่ว่าจะเป็นการใส่ในน้ำเงี้ยว แกงต่างๆของภาคเหนือ ข้าวซอยหรือแม้กระทั่งน้ำพริก ก็จะนิยมใส่ถั่วเน่าผงลงไปด้วยเพราะทำให้อาหารมีคุณค่าทางโภชนาการมากขึ้นเพราะถั่วจะช่วยเสริมพวกโปรตีนในอาหารที่เราทำนั้นเอง'
    }
  ])

  return { Otop_north_list }
})

// product otop ภาคตะวันออกเฉียงเหนือ
export const Otop_north_eastStore = defineStore('Otop_north_east', () => {
  const Otop_north_east_list = ref([
    {
      name: 'เสื้อคอจีนผ้าภูอัคนี',
      from: 'บุรีรัมย์',
      category: 'เสื้อผ้าและเครื่องแต่งกาย',
      price: 220,
      img: 'https://readthecloud.co/wp-content/uploads/2018/10/MG_9091.jpg.webp',
      text: 'กลุ่มแม่ป้านักทอมือฉมังแห่งชุมชนบ้านเจริญสุขรวมแฮงกายแฮงใจกันรังสรรค์ผ้าภูอัคนีขึ้นจากการนำเส้นฝ้ายไปย้อมกับดินภูเขาไฟ ได้เฉดน้ำตาลหลากหลายถูกใจ ตั้งแต่สีอ่อนนวลตาไปจนถึงเข้มอมแดง จากนั้นจึงนำไปถักทอเป็นสารพัดลวดลายที่ได้แรงบันดาลใจจากธรรมชาติรอบตัว ทั้งลายพื้นเรียบ ลายตีนแดง ลายสายฝน ลายไหลลาวา ออกมาเป็นของดีประจำถิ่น'
    },
    {
      name: 'ผ้าไหมมัดหมี่จากบ้านหัวฝาย',
      from: 'ขอนแก่น',
      category: 'ผ้าและเครื่องแต่งกาย',
      price: 590,
      img: 'http://i-san.tourismthailand.org/wp-content/uploads/2020/09/5-1.jpg',
      text: 'กลุ่มวิสาหกิจชุมชนบ้านหัวฝาย รวมตัวกันปฏิวัติวงการผ้าไหมมัดหมี่ ของขึ้นชื่อเมืองแก่นนครให้มีความร่วมสมัย สร้างแหล่งรายได้ให้สมาชิกชุมชนผ่านการทำแบรนด์สุภาณีไหมไทย เพื่อคุณภาพชีวิตที่ดีขึ้น ไหมจากชาวบ้านหัวฝายและหมู่บ้านใกล้เคียง นำมาผ่านกระบวนการการผลิตด้วยมือชาวบ้านทุกขั้นตอน แม้ไม่ได้สเกลใหญ่ไซส์อุตสาหกรรม ทำกันตามประสาชุมชน แต่เปี่ยมความมุ่งมั่นตั้งใจไม่แพ้กัน'
    },
    {
      name: 'ผ้าครามปักมือลายน่ารักไม่ซ้ำใครจากถิ่นภูพาน',
      from: 'สกลนคร',
      category: 'เสื้อผ้าและเครื่องแต่งกาย',
      price: 299,
      img: 'https://readthecloud.co/wp-content/uploads/2017/07/social-local-bhukram-6-750x500.jpg.webp',
      text: 'ความน่ารักของผ้าคลุมไหล่จากแบรนด์นี้ ไม่ใช่มาจากสีน้ำเงินเรียบหรูจากครามธรรมชาติ สีดำเข้มน่าดึงดูดจากดอกมะเกลือ หรือสีเขียวเหลืองนวลตาจากเปลือกมะม่วงเพียงเท่านั้น แต่ยังมาจากลวดลายที่บรรดาแม่ป้าหยิบจับเอาความงามจากสรรพธรรมชาติในอุทยานแห่งชาติภูพาน ทั้งต้นไม้ใบหญ้า ดอกนั่นดอกนี่ซึ่งคนกรุงฯ ไม่คุ้นตา มาเสกสร้างเส้นสายลวดลายแสนประณีต ใส่ใจลงไปในทุกๆ ฝีเข้มด้วยฝีมือฉบับชุมชนโดยแท้'
    },
    {
      name: 'เครื่องประดับดีไซน์เก๋จากผ้าไหมปักธงชัย',
      from: 'นครศรีธรรมราช',
      category: 'ของใช้และของประดิษฐ์',
      price: 350,
      img: ' https://readthecloud.co/wp-content/uploads/2019/10/la-orr-39-750x500.jpg.webp',
      text: 'สีสันแสนยียวน เงาวิ้งเล่นกับแสงไฟ ทำให้เครื่องประดับจากฝีมือการออกแบบของ ออม-สุพัจนา ลิ่มวงศ์ แห่ง La Orr (ละออ) ผู้จับเอาไหมโคราชมาประดับอยู่บนตัวเรือน ออกมาสวยสะดุดตา ใครเห็นเป็นต้องขอมือบอนเสียมารยาท หยิบมาลองสวมดูให้ได้สักครั้ง จนคว้ารางวัลด้านการออกแบบมาแล้วทั้งในไทยและต่างประเทศ เพราะดีไซน์เนอร์สาวเองก็หลงเสน่ห์ผ้าไหมผืนงามแห่งเมืองย่าโมตั้งแต่แรกเห็นเช่นกัน'
    },
    {
      name: 'เสื่อกกทอมือลายโมเดิร์น',
      from: 'อำนาจเจริญ',
      category: 'ของใช้และของประดิษฐ์',
      price: 590,
      img: 'https://www.hotelsinsidethailand.com/wp-content/uploads/2021/03/Portfolio-%E0%B8%81%E0%B8%81%E0%B8%81%E0%B8%B2%E0%B8%AC-KokKal-2.jpg',
      text: 'เสื่อกกในความทรงจำของคนที่ยังไม่รู้จักแบรนด์ Thorr คงไม่พ้นภาพอุปกรณ์ปูรองนั่งสามัญประจำบ้าน สีสันเจ็บแสบแยงตา ลายทอแบบเดิมซ้ำๆ กันไปเสียทุกผืน แต่ถ้าพอคุ้นหูคุ้นตาอยู่บ้างล่ะก็ รับรองว่าลืมภาพนั้นไปได้เลย เพราะ อุ๋งอิ๋ง-ธัญญ์นภัส กิ่งสุวรรณ เจ้าของแบรนด์ พิถีพิถันผัดแป้งเสื่อกกบ้านๆ แปลงโฉมเป็นโฮมแวร์ที่น่ารักจนต้องยกนิ้วให้ เพื่อถ่ายทอดความงดงามจากถิ่นอีสานรากเหง้า ลองคว้าเสื่อเบลนด์สีกรมท่ามาปูบนโต๊ะดูสักหน่อย รับรองว่าถ้าได้เห็น Thorr ในเหย้าในเรือนเมื่อไหร่ ไม่ว่าไผก็ต้องอยากเมือบ้านแน่นอน'
    },
    {
      name: 'เซ็ตกาน้ำชาปั้นมือจากดินคุณภาพดีแบรนด์ดอนหมูดิน',
      from: 'สกลนคร',
      category: 'ของใช้และของประดิษฐ์',
      price: 1200,
      img: 'https://scontent.fbkk4-4.fna.fbcdn.net/v/t39.30808-6/302321185_742031457161489_3391804010665666077_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=5f2048&_nc_eui2=AeFm_2a84iS-ib5KP4pfbwB8otqg3aSrxcai2qDdpKvFxrhmHAecoO4dgsKWvjbcOVUHebGJAURb17Kap8ogA3eT&_nc_ohc=MV82lZbkhh0AX8K_pPb&_nc_zt=23&_nc_ht=scontent.fbkk4-4.fna&_nc_e2o=f&oh=00_AfBCIBbVpOdD_xZLd_RgGOojZDnjGZn6TCs_qEbypAVw2Q&oe=653198A9',
      text: 'ดอนหมูดิน เป็นแบรนด์เทเบิลแวร์เนื้อเซรามิกชั้นดี เกิดจากความดิบแท้ดั้งเดิมวัถตุดิบขึ้นชื่ออย่างดินเหนียวในนา แร่ฟันม้า ดินเหนียวสีเหลือง เปลือกหอย และครามธรรมชาติ โดยมีจินตนาการของ เปิ้ล-วัลย์ริยา เพ็งสว่าง นักปั้น (เซรามิก) มือทอง และเอกลักษณ์ความเป็นสกลนคร เป็นส่วนผสมสำคัญที่ถืกนำมาเฮ็ดเป็นงานปั้นฟรีฟอร์มไม่รับปั้นรูปทรงตามใจ ไม่ใช้สีตามสั่ง ไม่ออกบูธตามงานแฟร์ใหญ่ๆ เพราะดอนหมูดินบรรจงทำทุกขั้นตอนด้วยมือ ขอบข่ายงานสุดจิ๋วเพียงระดับชุมชนชาวบ้านเท่านั้น สมใจของศิลปินสาวซึ่งอยากทอนการผลิตระดับอุตสาหกรรมออกไป '
    },
    {
      name: 'ดิฟฟิวเซอร์หินทรายจากเมืองย่าโม',
      from: 'นครศรีธรรมราช',
      category: 'ของใช้และของประดิษฐ์',
      price: 55,
      img: 'https://readthecloud.co/wp-content/uploads/2021/04/isan-craft-products-sandstone-1-750x500.jpg.webp',
      text: 'หินทรายแผ่นแบนหน้ากลมสีพาสเทลยวนใจ ล้อมรอบด้วยไม้โอ๊กลายสวยสะอาดตาเล่าอย่างนี้เห็นทีจะไม่เข้าใจ งั้นขอเฉลยเลยแล้วกันแท่น แทน แท้น! นี่คือ Sandstone Diffuser หรือหินทรายกระจายกลิ่นทรงแปลกตาจากนวยนาด แบรนด์ของคู่สามีภรรยาที่ตัดสินใจกลับบ้านเกิดมาทำผลิตภัณฑ์เครื่องใช้เครื่องหอมจากวัตถุดิบอีสาน'
    },
    {
      name: 'เก้าอี้หวายแบรนด์ LITIN ฝีมือช่าง',
      from: 'มหาสารคาม',
      category: 'ของใช้และของประดิษฐ์',
      price: 590,
      img: 'https://readthecloud.co/wp-content/uploads/2021/04/isan-craft-products-litin-1-750x500.jpg.webp',
      text: 'ลิตเติ้ล-สมฤทัย บุญใหญ่ แห่งแบรนด์ LITIN จึงหันมาออกแบบเฟอร์นิเจอร์โดยใช้หวายเป็นหลัก ผสมกับลวดลายกราฟิกร่วมสมัย ยิ่งได้ฝีมือการจักสานของพี่น้องชาวสารคามสูผู้สูคน งานที่ได้จึงยังมีกลิ่นอีสานแฝงอยู่กับความประณีตสวยงามอย่างแนบเนียน เป็นลายเซ็นของแบรนด์ไปโดยปริยาย'
    },
    {
      name: 'น้ำพริกตาแดงแม่เล็บทอง(สูตรโบราณ)',
      from: 'บึงกาฬ',
      category: 'เสื้อผ้าและเครื่องแต่งกาย',
      price: 390,
      img: 'https://th-test-11.slatic.net/p/4ac364fedd32f74579615451a8ecdcc9.jpg',
      text: 'แม้ผ้าขาวม้าจะใช้งานได้หลากหลายจนนิ้วมือทั้งสิบไม่พอนับ แต่เนื้อผ้าสุดหยาบ สีแป๋นแหลนแสบตา ลวดลายแสนเชย ทำให้ใครต่อใครไม่กล้าหยิบฉวยมาใช้งานจริง พักก่อน ลืมภาพจำลบๆ ไปได้เลยถ้าได้ลองจับผ้าขาวม้าสัมผัสนุ่มสุดฟินจากดารานาคี แบรนด์ผ้าขาวม้าฝีมือระดับเซียน ต้นตำรับผ้าย้อมโคลนพันปีจากแม่น้ำโขงแห่งกลุ่มทอผ้าพื้นเมืองบ้านสะง้อ แบรนด์ผ้าขาวม้าดารานาคี จากจังหวัดน้องใหม่ลำดับที่ 77 อย่างบึงกาฬ'
    },
    {
      name: 'กระเป๋าผ้าฝ้ายย้อมสีธรรมชาติจากแดนดอกฝ้าย',
      from: 'เลย',
      category: 'ของใช้และของประดิษฐ์',
      price: 290,
      img: 'https://readthecloud.co/wp-content/uploads/2018/07/work-crafting-folkcharm-7.jpg.webp',
      text: 'ไม่ต้องรองานดอกฝ้ายเมืองเลย เราก็สัมผัสความละมุนของผ้าฝ้ายธรรมชาติได้ เพราะเพียงเห็นสินค้าจาก FolkCharm ของ ลูกแก้ว-ภัสสร์วี โคะดากะ ร่างกายก็พร้อมทิ้งตัวย้วยไปความนุ่มนิ่มน่ารักของผืนผ้าแล้ว  เพราะทำจากเศษผ้าเหลือใช้จากกระบวนการผลิตสินค้าตัวอื่นๆ เย็บต่อกันด้วยมือเป็นลวดลายแตกต่างกันออกไป ทนทานสมกับเป็นของทำมือ พกพาไปไหนไม่อายใคร ใช้ทนใช้นานในใบเดียวกัน'
    }
  ])

  return { Otop_north_east_list }
})

// product otop ภาคกลาง
export const Otop_centralStore = defineStore('Otop_central', () => {
  const Otop_central_list = ref([
    {
      name: 'น้ำตาลมะพร้าวผลิตภัณฑ์ otop',
      from: 'สมุทรสงคราม',
      category: 'อาหาร',
      price: 150,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/1-1-1.jpg.webp',
      text: 'น้ำตาลมะพร้าวผลิตภัณฑ์ otop ของวิสาหกิจชุมชน จ.สมุทรสงคราม ปลูกในสวนที่มีอากาศบริสุทธิ์ และผลิตโดยกรรมวิธีแบบโบราณโดยภูมิปัญญาชาวบ้าน โดยคัดสรรวัตถุดิบจากมะพร้าวแท้ๆด้วยวิธีเคี่ยวแบบ โบราณด้วยเตาฟืน ทำให้ได้กลิ่นหอมแบบธรรมชาติ ปราศจากน้ำตาลทราย ,สารกันบูด,สารฟอกขาว เพื่อให้ได้น้ำตาลมะพร้าวที่มีคุณภาพ น้ำตาลมะพร้าวแท้ๆจากสมุทรสงคราม'
    },
    {
      name: 'มะขามหวานแกะเปลือกพันธุ์สีชมพู ',
      from: 'เพชรบูรณ์',
      category: 'ของขบเคี้ยว',
      price: 120,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/2-1-2.jpg.webp',
      text: ' มะขามหวาน จากจ.เพชรบูรณ์เป็นผลไมท้ ี่มีชื่อเสียงของจงัหวดั และข้ึนชื่อเรื่องมะขามหวานเป็นอนั ดบั หน่ึงของประเทศ โดยได้คัดสรรจากมะขามออร์แกนิกจากสวน และน ามะขามหวานพันธุ์สีชมพูมาแกะเปลือกพร้อมทาน เป็นผลไม้แปรรูปที่ ทานง่ายและสามารถเก็บรักษาไดย้าวนานข้ึน ,ไม่มีสารปรุงแต่ง, ไม่มีสารกนั บูด รสชาติของมะขามหวานอมเปรี้ยวเล็กน้อย'
    },
    {
      name: 'น้ำผึ้งป่าเดือนห้า otop',
      from: 'พิษณุโลก',
      category: 'อาหาร',
      price: 500,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/3-1-1.jpg.webp',
      text: 'คนทั่วไปรู้จักถึงประโยชน์ของน้ำผึ้งกันเป็นอย่างดี น้ำผึ้งประกอบไปด้วยน้ำตาลฟลุคโตสเป็นหลัก และร่างกายของเราสามารถดูดซึมไปใช้ประโยชน์ได้ง่าย ไทฮันนี่ควีนเป็นน้ำผึ้งแท้บริสุทธิ์ที่เป็นสุดยอดสินค้าโอทอป ซึ่งสามารถบริโภคได้ทุกเพศทุกวัย โดยน้ำผึ้งที่มีคุณภาพดีจะต้องเป็นน้ำผึ้งเดือนห้า '
    },
    {
      name: 'กล้วยลืมเบรค otop',
      from: 'ราชบุรี',
      category: 'ของขบเคี้ยว',
      price: 80,
      img: ' https://fav-agoodtime.com/wp-content/uploads/2021/12/4-1-1.jpg.webp',
      text: 'กล้วยเป็นผลไม้ที่อุดมไปด้วยวิตามินและแร่ธาตุต่างๆที่จำเป็นต่อร่างกาย เช่น ธาตุเหล็ก ,ฟอสฟอรัส ,โพแทสเซียม และประโยชน์ของกล้วยก็มีมากมาย ช่วยเพิ่มพลังงาน ,แก้ท้องผูกและบำรุงระบบประสาท กล้วยลืมเบรคเป็นสินค้าโอทอปของราชบุรี ที่เป็นการเพิ่มมูลค่าให้กับกล้วยหอมทอง เป็นสินค้าโอทอปที่ช่วยสร้างงาน สร้างรายได้ให้กับท้องถิ่น'
    },
    {
      name: 'เซรั่มน้ำมันงา otop',
      from: 'สมุทรปราการ',
      category: 'ของใช้เครื่องสำอาง',
      price: 160,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/5-1.jpg.webp',
      text: 'เซรั่มน้ำมันงาแบรนด์รักษ์สมุนไพร จากวิสาหกิจชุมชนบางบ่อ เป็นสินค้าโอทอประดับ4ดาวของจ.สมุทรปราการ ซึ่งผลิตจากน้ำมันงาดำบริสุทธิ์ที่อุดมไปด้วยสารต้านอนุมูลอิสระซึ่งฟื้นฟูเซลล์ผิวและเซลล์ผม และงาดำยังมีสารที่เป็นประโยชน์ต่อร่างกายช่วยปกป้องผมจากแสงแดด และเพิ่มการไหลเวียนเลือดของหนังศีรษะ'
    },
    {
      name: 'ยาหม่องเสลดพังพอน สมุนไพรวังพรม otop',
      from: 'นครปฐม',
      category: 'ของใช้และของประดิษฐ์',
      price: 120,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/6-1-1.jpg.webp',
      text: 'สมุนไพรวังพรมเป็นโอทอป5ดาวของจ.นครปฐม ซึ่งเป็นการนำสมุนไพรของไทยมาผสมผสานกับภูมิปัญญาชาวบ้านมาผลิตเป็นยารักษาโรค สมุนไพรวังพรมเป็นที่รู้จักในฐานะผู้ผลิตยาในอันดับต้นๆของประเทศ และได้รับการยอมรับในเรื่องของคุณภาพ และในปัจจุบันนี้ทายาทรุ่นที่2ของสมุนไพรวังพรม'
    },
    {
      name: 'อาหารเสริมจมูกข้าวกล้องหอมนิล otop',
      from: 'อยุธยา',
      category: 'อาหารเสริม',
      price: 220,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/7-1-1.jpg.webp',
      text: 'จมูกข้าวกล้องหอมนิลเป็นผลิตภัณฑ์อาหารเสริม otop4ดาว ของจ.อยุธยา เป็นผลิตภัณฑ์ที่ช่วยสร้างงาน และนำทรัพยากรในท้องถิ่นมาใช้ประโยชน์และสร้างรายได้ให้กับชุมชน อาหารเสริมตัวนี้ผลิตจากจากข้าวหอมนิลธรรมชาติ ไร้สารตกค้าง และที่สำคัญยังมีส่วนช่วยให้ร่างกายแข็งแรง และสร้างภูมิคุ้มกันให้กับร่างกาย'
    },
    {
      name: 'คุกกี้รสกระเจี๊ยบผสมธัญพืช otop',
      from: 'สระบุรี',
      category: 'ของขบเคี้ยว',
      price: 259,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/8-1-1.jpg.webp',
      text: 'คุกกี้รสกระเจี๊ยบผสมธัญพืชเป็น otopของดีสระบุรี เป็นภูมิปัญญาท้องถิ่นที่ต่อยอดไปสู่ธุรกิจเงินแสน และสามารถครองใจคนรักสุขภาพ ซึ่งในปัจจุบันนี้คนใส่ใจเรื่องอาหารการกินกันมากขึ้น คุกกี้รสกระเจี๊ยบมีส่วนผสมของสมุนไพรกระเจี๊ยบและเมล็ดธัญพืช และที่สำคัญในกระเจี๊ยบมีสารแอนโทโซยานิลที่ช่วยต้านอนุมูลอิสระให้แคลเซียมสูง'
    },
    {
      name: 'ทองม้วนน้ำตาลโตนด otop',
      from: 'เพชรบุรี',
      category: 'ของขบเคี้ยว',
      price: 50,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/9-1-1.jpg.webp',
      text: 'ทองม้วนน้ำตาลโตนดแท้จากกลุ่มแม่บ้านไร่หัวลุ่มเป็นสินค้าotopระดับ 4ดาว ของจ.เพชรบุรี ถือเป็นอีกตัวอย่างหนึ่งของการรวมตัวและพัฒนาสินค้าของตำบลมาอย่างต่อเนื่องและยั่งยืน ที่สามารถสร้างรายได้ให้กับคนในชุมชุนให้มีรายได้อย่างต่อเนื่อง ซึ่งความพิเศษของทองม้วนที่นี่จะใช้น้ำตาลโตนดแท้ซึ่งซื้อจากชาวบ้านที่ทำน้ำตาลโตนดในหมู่บ้าน'
    },
    {
      name: 'น้ำส้มควันไม้',
      from: 'พิจิตร',
      category: 'ของใช้และของประดิษฐ์',
      price: 25,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/10-1-1.jpg.webp',
      text: 'น้ำส้มควันไม้เป็นของเหลวที่ได้จากการกลั่นตัวเป็นหยดน้ำของควันที่เกิดจากกรรมวิธีเผาถ่าน ซึ่งมีประโยชน์มากมายหลายอย่างโดยสามารถนำมาใช้ในครัวเรือน,ด้านเกษตรกรรมและด้านปศุสัตว์ น้ำส้มควันไม้เป็นสินค้าotopของจ.พิจิตร ที่ผลิตจากไม้ส้ม,ไม้สะเดา,ไม้ยูคาลิปตัส ,ไม้มะม่วง,ไม้มะปราง เป็นสูตรเข้มข้น 100% สารที่ได้มาจากธรรมชาติไม่เป็นพิษต่อสิ่งแวดล้อมและสัตว์เลี้ยง'
    }
  ])

  return { Otop_central_list }
})

// product otop ตะวันออก
export const Otop_eastStore = defineStore('Otop_east', () => {
  const Otop_east_list = ref([
    {
      name: 'เจ พี อาร์ อันดามันคอฟฟี่',
      from: 'ระนอง ',
      category: 'เครื่องดื่ม',
      price: 75,
      img: 'https://www.ranongcities.com/travel/tmp/23c9524785fa73a6f5266c2b55f22012.jpg',
      text: 'มล็ดกาแฟพันธุ์โรบัสต้าของตำบล จ.ป.ร. อำเภอกระบุรี ชนะเลิศการประกวดพืชผลเกษตรระดับประเทศ ต่อมาราคากาแฟต่ำลง จึงได้แปรรูปกาแฟ เป็นกาแฟคั่วบด มีรสชาติขม กลมกล่อม หอม มัน อร่อย'
    },
    {
      name: 'ผลิตภัณฑ์อาหาร บีโบ้ ',
      from: 'ระนอง',
      category: 'อาหารสัตว์',
      price: 150,
      img: 'https://www.ranongcities.com/travel/tmp/51e41be8442ab77a72c8cee81090baed.jpg',
      text: ' ระนองเป็นจังหวัดที่มีการทำประมงและเป็นแหล่งจำหน่ายปลาและสัตว์น้ำอื่นๆ เนื่องจากมีทรัพยากรทางทะเลจำนวนมาก จึงได้มีการแปรรูปเป็นอาหารชนิดต่างๆ จนเป็นที่รู้จักของผู้บริโภคอย่างแพร่หลายทั้งภายในและต่างจังหวัด เนื่องจากมีความสด อร่อย'
    },
    {
      name: 'เม็ดมะม่วงหิมพานต์เผา',
      from: 'ระนอง',
      category: 'ของขบเคี้ยว',
      price: 180,
      img: 'https://www.ranongcities.com/travel/tmp/5e2044de66d8a6765f83061b63d73e93.jpg',
      text: 'ชาวตำบลหงาวมีอาชีพทำสวนมะม่วงหิมพานต์ และได้นำเม็ดมะม่วงหิมพานต์ (กาหยู) มาแปรรูปโดยการเผา และอบ ซึ่งเม็ดมะม่วงหิมพานต์เผา ของตำบลหงาว มีชื่อเสียงมาก เพราะใช้วิธีการเผาแบบโบราณ ทำให้มีรสชาติอร่อย หอม หวาน กรอบ เป็นที่รู้จักอย่างแพร่หลาย '
    },
    {
      name: 'น้ำแร่ธรรมชาติตราเมืองนอง',
      from: 'ระนอง',
      category: 'เครื่องดื่ม',
      price: 20,
      img: ' https://www.ranongcities.com/travel/tmp/c1d2cbe6176a8030af94e705ff0b6d31.jpg',
      text: 'ระนองเป็นจังหวัดที่มีน้ำแร่ธรรมชาติที่มีแร่ธาตุต่างๆเป็นประโยชน์ต่อร่างกาย จึงมีผู้ผลิตนำน้ำแร่มาผลิตเป็นน้ำดื่ม โดยผ่านกระบวนการวิเคราะห์ตรวจสอบจาก กระทรวงสาธารณสุข ได้รับการรับรองมาตรฐานผลิตภัณฑ์ มอก. และ อย.'
    },
    {
      name: 'น้ำแร่ธรรมชาติเพื่อบริโภคตราราน่า',
      from: 'ระนอง',
      category: 'เครื่องดื่ม',
      price: 20,
      img: 'https://www.ranongcities.com/travel/tmp/649a31bd38ca284b7690dbbafd7cc9b2.jpg',
      text: 'ได้รับโอนกิจการจากเจ้าของเดิม(หม่อมฤทธิเทพ เทวกุล) ประมาณปี 2533 ซึ่งบริษัทได้รับความร่วมมือจากบริษัทบริดวิค ประเทศอังกฤษ แนะนำกรรมวิธีการผลิตน้ำแร่ธรรมชาติ เพื่อบริโภคตามมาตรฐานยุโรป จนได้รับให้ขึ้นทะเบียนตำรับอาหารและยา จากคณะกรรมการอาหารและยา กระทรวงสาธารณสุข'
    },
    {
      name: 'สับปะรดกวนกะทิ',
      from: 'ระนอง',
      category: 'ของขบเคี้ยว',
      price: 100,
      img: 'https://www.hoteldirect.in.th/images/otop/Rayong/pineapple-kathi.jpg',
      text: 'สับปะรดกวนกะทิ คือเป็นผลิตภัณฑ์ แปรรูปจากสับปะรดจากท้องถิ่นที่มีคุณภาพ มีการผลิตที่สะอาดถูกหลักอนามัยตัวผลิตภัณฑ์มีรสชาติ หวาน มัน อร่อย ถูกใจผู้บริโภค ผ่านการรับรองมาตรฐาน อย. มผช.GMPบรรจุภัณฑ์มีทั้งแบบบรรจุถุงพลาสติกและแบบกล่องบรรจุสวยงาม'
    },
    {
      name: 'น้ำปลาตรานากุ้ง',
      from: 'ระนอง',
      category: 'อาหาร',
      price: 150,
      img: 'https://www.hoteldirect.in.th/images/otop/Rayong/nampla-nakung.jpg',
      text: 'น้ำปลาตรานากุ้ง คือ เป็นผลิตภัณฑ์ที่มาจากภูมิปัญญาของคนในชุมชนต.เนินฆ้อ ที่ได้นำปลาหัวอ่อนมาหมักกับเกลือ ซึ่งปลาหัวอ่อนมีคุณค่าทางโภชนาการ ข้อสำคัญ น้ำปลาตรานากุ้ง มีลักษณะใส สีแดง ไม่ปรุงแต่งรสและกลิ่น มีความเป็นน้ำปลาอย่างสมบูรณ์'
    },
    {
      name: 'ลอดช่องสิงคโปร์',
      from: 'ระนอง',
      category: 'อาหาร',
      price: 490,
      img: 'https://www.hoteldirect.in.th/images/otop/Rayong/lod-chong-Singapore.jpg',
      text: 'ลอดช่องสิงคโปร์เป็นอาชีพที่สะท้อนถึงการสืบสานวัฒนธรรมแบบการทำงานอย่าง มีขั้นตอนกับการผูกพันของท้องถิ่นในปัจจุบัน โดยคงมีสภาพความทรงจำในการดำเนินชีวิตดั้งเดิมหรือคงอาชีพแบบเรียบง่าย และเปรียบเทียบด้วยการมีศิลปะแห่งการผูกพัน'
    },
    {
      name: 'น้ำพริกปลากะตัก',
      from: 'ระนอง',
      category: 'อาหาร',
      price: 200,
      img: 'https://www.hoteldirect.in.th/images/otop/Rayong/namprik-plakratuk.jpg',
      text: 'น้ำพริกปลากะตักคือ เป็นที่น้ำพริกที่อุดมไปด้วยแคลเซียม เนื่องจากมีปลาเป็นส่วนประกอบ และได้รับรางวัล OTOP Product Championปี พ.ศ.2549 ระดับ 4 ดาว'
    },
    {
      name: 'น้ำส้มควันไม้',
      from: 'ระนอง',
      category: 'ของใช้และของประดิษฐ์',
      price: 390,
      img: 'https://www.hoteldirect.in.th/images/otop/Rayong/aloeswood-product.jpg',
      text: 'ไม้กฤษณาเป็นสิ่งที่หาได้ยากมากในธรรมชาติและเนื้อแก่น ไม้จะมีราคาค่อนข้างสูง ในการที่กลุ่มสามารถผลิตแก่นไม้โดยมีคุณภาพและคุณสมบัติที่คล้ายคลึงกับธรรมชาติได้สูงสุดนั้น นับได้ว่าถือเป็นภูมิปัญญาอันสูงสุดที่สามารถสร้างให้เกิดรายได้กับชุมชน'
    }
  ])

  return { Otop_east_list }
})

// product otop ใต้
export const Otop_southStore = defineStore('Otop_south', () => {
  const Otop_south_list = ref([
    {
      name: 'แกงไตปลาแห้ง (แม่พรรณ)',
      from: 'สุราษฏร์ธานี ',
      category: 'อาหาร',
      price: 100,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/1-1-9.jpg.webp',
      text: 'เริ่มที่ของกินขึ้นชื่อของทางภาคใต้ที่มีเอกลักษณ์เฉพาะตัว ที่แค่ได้ยินชื่อก็รู้ได้ทันที่ว่าเป็นอาหารของทางภาคใต้ นั่นก็คือ แกงไตปลานั่นเอง และเพื่อให้สามารถบรรจุในกระปุกเพื่อง่ายต่อการขายแล้วนั้น จึงได้ทำการแปรรูปให้เป็น แกงไตปลาแห้ง เพื่อที่จะสามารถเก็บไว้ได้นานอีกทั้งยังยืดอายุให้กับแกงไตปลาทานได้นานขึ้นอีกด้วย'
    },
    {
      name: 'มะม่วงแช่อิ่มแม่ทม ',
      from: 'สตูล',
      category: 'ของขบเคี้ยว',
      price: 95,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/2-1-10.jpg.webp',
      text: ' มะม่วงแช่อิ่มของทานเล่นที่มีมานานแสนนานคู่กับคนไทย ซึ่งวันนี้จะแนะนำให้รู้จักกับมะม่วงแช่อิ่มแม่ทมสูตรดั้งเดิม ของอร่อยจากจังหวัดสตูล ที่ผ่านการผลิตอย่างพิถีพิถันโดยความร่วมมือร่วมใจของกลุ่มชาวบ้านตันหยงโป จึงทำให้ได้มะม่วงเบาแช่อิ่มที่มีรสชาติหวานอมเปรี้ยว เนื้อกรอบ อร่อยถูกปาก'
    },
    {
      name: 'ปลาสวรรค์สมุนไพร (พร้อมทาน)',
      from: 'พัทลุง',
      category: 'อาหาร',
      price: 200,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/3-1-9.jpg.webp',
      text: 'นอกจากหมูสวรรค์อาหารจานโปรดของใครหลายๆคนแล้ว ก็ยังมี ปลาสวรรค์สมุนไพรแสนอร่อยที่เป็นสินค้า OTOP ประจำจังหวัดพัทลุงที่ใครๆมาก็ต้องหาซื้อเป็นของฝากกลับไป เพราะเมื่อพูดถึงรสชาตินั้นทางแบรนด์ได้ใช้สูตรลับความอร่อยในการหมักทำให้ได้รสชาติที่มีความหอมหวานอร่อยที่เพียงทานแค่ชิ้นเดียวจะหยุดไม่อยู่อย่างแน่นอน'
    },
    {
      name: 'กรือโป๊ะปลา ตรา Befish',
      from: 'นราธิวาส',
      category: 'ของขบเคี้ยว',
      price: 239,
      img: ' https://fav-agoodtime.com/wp-content/uploads/2021/12/4-1-9.jpg.webp',
      text: 'เมื่อพูดถึงของทานเล่นทางภาคใต้ที่ขึ้นชื่อแล้วล่ะก็ กรือโป๊ะเป็นอีก 1 อย่างที่เป็นของทานเล่นของภาคใต้โซนล่าง ซึ่งของแบรนด์นี้ได้นำมาแปรรูปและทำบรรจุภัณฑ์เป็นอย่างดี เพื่อให้ง่ายต่อการซื้อขายและรสชาติความกรอบอยู่ได้นานมากขึ้น หาซื้อได้ทางช่องทางออนไลน์และร้านขายของฝากภาคใต้ประจำท้องถิ่น'
    },
    {
      name: 'ลูกตาลแช่อิ่มอบแห้ง ตราโหนดนิ',
      from: 'สงขลา',
      category: 'ของขบเคี้ยว',
      price: 100,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/5-1-8.jpg.webp',
      text: 'นอกจากลูกตาลแช่อิ่มหวานๆ ที่ยิ่งทานแช่เย็นแล้วอร่อยนั้น ลูกตาลแช่อิ่มแบบอบแห้งก็อร่อยไม่แพ้กัน นอกจากนี้ยังมีประโยชน์อีกมากมายในลูกตาลไม่ว่าจะเป็นคาร์โบไฮเดรด แคลเซียม ฟอสฟอรัส เหล็ก และวิตามินซี รวมถึงยังมีสรรพคุณช่วยบรรเทาอาการร้อนใน ทานแล้วชุ่มคอ ช่วยลดอาการกระหายน้ำได้เป็นอย่างดี'
    },
    {
      name: 'กระเป๋าถือ (Handle Bag)',
      from: 'ตรัง',
      category: 'ของใช้และของประดิษฐ์',
      price: 100,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/6-1-9.jpg.webp',
      text: 'กระเป๋าถือที่ทำจากเส้นใยของเตยปาหนันจะมีความยืดหยุ่น และลักษณะเป็นมันเงา มีคุณสมบัติเหนียว ผิวมัน ไม่มีเชื้อรา ทำให้ผลิตกระเป๋าออกมาได้อย่างสวยงาม ซึ่งนอกจากจะเป็นกระเป๋าถือแล้ว ยังมีรูปแบบกระเป๋าให้เลือกอีกมากมายไม่ว่าจะเป็นกระเป๋าสตางค์ กระเป๋านามบัตร ซองใส่แว่นตา หรือกล่องดินสอ'
    },
    {
      name: 'หมอนรองคอยางพารา',
      from: 'ตรัง',
      category: 'ของใช้และของประดิษฐ์',
      price: 390,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/7-12.jpg.webp',
      text: 'ยางพาราเป็นพืชเศรษฐกิจที่มีความสำคัญต่อเศรษฐกิจของจังหวัดตรัง ต่อมากลุ่มวิสาหกิจชุมชนพาสว่างพาราจึงคิดวิธีนำผลผลิตที่ได้มาพัฒนาต่อยอด เป็นของฝากของที่ระลึกหลากหลายรูปแบบ และยังเป็นการเพิ่มมูลค่าให้กับชาวสวนยางเสริมสร้างรายได้ให้กับคนในชุมชน'
    },
    {
      name: 'สร้อยข้อมือไข่มุก',
      from: 'พังงา',
      category: 'ของใช้และของประดิษฐ์',
      price: 699,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/8-1-10.jpg.webp',
      text: 'สร้อยข้อมือไข่มุก ของขึ้นชื่อจังหวัดพังงา เป็นที่นิยมอย่างมากทั้งในกลุ่มลูกค้าไทยและชาวต่างชาติ ซึ่งหากเป็นไข่มุกสีขาว เป็นสัญลักษณ์ของความเป็นเลิศและความมีอุดมคติ ไข่มุกสีดำ เป็นตัวแทนของผู้มีปรัชญา และไข่มุกสีชมพูเป็นตัวแทนของความสวยงาม และด้วยความที่ไข่มุกเป็นอัญมณีอินทรีย์'
    },
    {
      name: 'ครีมนวดเส้น บ้านวังอินทร์',
      from: 'ตรัง',
      category: 'ของใช้เครื่องสำอาง',
      price: 150,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/9-1-9.jpg.webp',
      text: 'สำหรับใครที่รักในการนวดผ่อนคลาย แนะนำครีมนวดเส้นของบ้านวังอินทร์เลยค่ะ ซึ่งสรรพคุณคือช่วยนวดแก้อาการพังผืดใต้ผิวหนัง ตั้งแต่มือ เท้า ขา ปวดข้อ ปวดเอ็น และอาการปวดกล้ามเนื้อต่างๆ ถือว่าครีมนวดเส้นตัวนี้ช่วยบรรเทาอาการได้อย่างดี'
    },
    {
      name: 'ไม้กวาดจากขวดพลาสติก',
      from: 'ระนอง',
      category: 'ของใช้และของประดิษฐ์',
      price: 50,
      img: 'https://fav-agoodtime.com/wp-content/uploads/2021/12/10-8.jpg.webp',
      text: 'สินค้าปิดท้ายที่จะมาแนะนำในรีวิวครั้งนี้ก็คือ ไม้กวาดจากขวดพลาสติก ซึ่งได้แนวคิดมาจากผู้ใหญ่ชัยรีไซเคิล  ที่นำเอาขวดพลาสติก นำมาผลิตเป็นไม้กวาด จากการนำเอาขวดพลาสติกที่ไม่ใช้แล้วนั้นไปเข้าเครื่องปั่นเส้น จนได้ออกมาเป็นเส้นไม้กวาดพลาสติก '
    }
  ])

  return { Otop_south_list }
})
